; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 119680 2 2 2 3 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	thermograph0 - mode
	thermograph1 - mode
	Star2 - direction
	Star1 - direction
	GroundStation0 - direction
	Phenomenon3 - direction
	Planet4 - direction
	Planet5 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon3)
	(supports instrument1 thermograph1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
)
(:goal (and
	(pointing satellite1 Star2)
	(have_image Phenomenon3 thermograph0)
	(have_image Planet4 thermograph1)
	(have_image Planet5 thermograph1)
))

)

; plan
1. (turn_to satellite1 star2 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star2)
   goals met: 1 of 4
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 4
3. (turn_to satellite0 star1 phenomenon3)
   deleted: (pointing satellite0 phenomenon3)
   added: (pointing satellite0 star1)
   goals met: 1 of 4
4. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 4
5. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 1 of 4
6. (turn_to satellite1 planet4 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet4)
   goals met: 0 of 4
7. (turn_to satellite0 planet5 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet5)
   goals met: 0 of 4
8. (turn_to satellite1 star2 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 star2)
   goals met: 1 of 4
9. (take_image satellite0 planet5 instrument0 thermograph1)
   added: (have_image planet5 thermograph1)
   goals met: 2 of 4
10. (turn_to satellite1 phenomenon3 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon3)
   goals met: 1 of 4
11. (turn_to satellite0 planet4 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet4)
   goals met: 1 of 4
12. (turn_to satellite1 star2 phenomenon3)
   deleted: (pointing satellite1 phenomenon3)
   added: (pointing satellite1 star2)
   goals met: 2 of 4
13. (take_image satellite0 planet4 instrument0 thermograph1)
   added: (have_image planet4 thermograph1)
   goals met: 3 of 4
14. (turn_to satellite0 phenomenon3 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 phenomenon3)
   goals met: 3 of 4
15. (take_image satellite0 phenomenon3 instrument0 thermograph0)
   added: (have_image phenomenon3 thermograph0)
   goals met: 4 of 4
